using System;
using System.Collections.Generic;
using System.Text;

namespace Traducteur_FrancoJaponais.Constants
{
    public static class Hiragana
    {
        public static Dictionary<string, string> _Dictionary = new Dictionary<string, string>()
        {
            {"kya", "きや"},                           {"kyo", "きょ"},{"kyu", "きゆ"},
            {"gya", "ぎや"},                           {"gyo", "ぎょ"},{"gyu", "ぎゆ"},
            {"sha", "しや"},                           {"sho", "しょ"},{"shu", "しゆ"},
            {"ja", "じや"},                            {"jo", "じょ"} ,{"ju", "じゆ"},
            {"cha", "ちや"},                           {"cho", "ちょ"},{"chu", "ちゆ"},
            {"nya", "にや"},                           {"nyo", "にょ"},{"nyu", "にゆ"},
            {"hya", "ひや"},                           {"hyo", "ひょ"},{"hyu", "ひゆ"},
            {"bya", "びや"},                           {"byo", "びょ"},{"byu", "びゆ"},
            {"pya", "ぴや"},                           {"pyo", "ぴょ"},{"pyu", "ぴゆ"},
            {"mya", "みや"},                           {"myo", "みょ"},{"myu", "みゆ"},
            {"rya", "りや"},                           {"ryo", "りょ"},{"ryu", "りゆ"},

            {"ka", "か"}, {"ke", "け"}, {"ki", "き"},  {"ko", "こ"}, {"ku", "く"},
            {"sa", "さ"}, {"se", "ぜ"}, {"shi", "し"}, {"so", "そ"}, {"su", "す"},
            {"ta", "た"}, {"te", "て"}, {"chi", "ち"}, {"to", "と"}, {"tsu", "つ"},
            {"na", "な"}, {"ne", "ね"}, {"ni", "に"},  {"no", "の"}, {"nu", "ぬ"},
            {"ha", "は"}, {"he", "へ"}, {"hi", "ひ"},  {"ho", "ほ"}, {"fu", "ふ"},
            {"ma", "ま"}, {"me", "め"}, {"mi", "み"},  {"mo", "も"}, {"mu", "む"},
            {"ra", "ら"}, {"re", "れ"}, {"ri", "り"},  {"ro", "ろ"}, {"ru", "る"},
            {"ya", "や"},                             {"yo", "ょ"}, {"yu", "ゆ"},
            {"wa", "わ"},                             {"wo", "を"},
            {"n", "ん"},
            {"ga", "が"}, {"ge", "げ"}, {"gi", "ぎ"},  {"go", "ご"}, {"gu", "ぐ"},
            {"za", "ざ"}, {"ze", "ぜ"}, {"ji", "じ"},  {"zo", "ぞ"}, {"zu", "ず"},
            {"da", "だ"}, {"de", "で"},/*{"ji", "ぢ"},*/ {"do", "ど"}, /*{"zu", "づ"},*/
            {"ba", "ば"}, {"be", "べ"}, {"bi", "び"},  {"bo", "ぼ"}, {"bu", "ぶ"},
            {"pa", "ぱ"}, {"pe", "ぺ"}, {"pi", "ぴ"},  {"po", "ぽ"}, {"pu", "ぷ"},
            {"a", "あ"},  {"e", "え"},  {"i", "い"},   {"o", "お"},  {"u", "う"},
        };

    }
}
