using System;
using System.Collections.Generic;
using System.Text;

namespace Traducteur_FrancoJaponais.Constants
{
    public static class Katakana
    {
        public static Dictionary<string, string> _Dictionary = new Dictionary<string, string>()
        {
            {"kya", "キャ"},                           {"kyo", "キョ"},{"kyu", "キュ"},
            {"gya", "ギャ"},                           {"gyo", "ギョ"},{"gyu", "ギュ"},
            {"sha", "シャ"},                           {"sho", "ショ"},{"shu", "シュ"},
            {"ja", "ジャ"},                            {"jo", "ジョ"} ,{"ju", "ジュ"},
            {"cha", "チャ"},                           {"cho", "チョ"},{"chu", "チュ"},
            {"nya", "ニャ"},                           {"nyo", "ニョ"},{"nyu", "ニュ"},
            {"hya", "ヒャ"},                           {"hyo", "ヒョ"},{"hyu", "ヒュ"},
            {"bya", "ビャ"},                           {"byo", "ビョ"},{"byu", "ビュ"},
            {"pya", "ピャ"},                           {"pyo", "ピョ"},{"pyu", "ピュ"},
            {"mya", "ミャ"},                           {"myo", "ミョ"},{"myu", "ミュ"},
            {"rya", "リャ"},                           {"ryo", "リョ"},{"ryu", "リュ"},

            {"ta", "タ"}, {"te", "テ"}, {"chi", "チ"}, {"to", "ト"}, {"tsu", "ツ"},
            {"ka", "カ"}, {"ke", "ケ"}, {"ki", "キ"},  {"ko", "コ"}, {"ku", "ク"},
            {"sa", "サ"}, {"se", "セ"}, {"shi", "シ"}, {"so", "ソ"}, {"su", "ス"},
            {"na", "ナ"}, {"ne", "ネ"}, {"ni", "ニ"},  {"no", "ノ"}, {"nu", "ヌ"},
            {"ha", "ハ"}, {"he", "ヘ"}, {"hi", "ヒ"},  {"ho", "ホ"}, {"fu", "フ"},
            {"ma", "マ"}, {"me", "メ"}, {"mi", "ミ"},  {"mo", "モ"}, {"mu", "ム"},
            {"ra", "ラ"}, {"re", "レ"}, {"ri", "リ"},  {"ro", "ロ"}, {"ru", "ル"},
            {"ya", "ヤ"},                             {"yo", "ヨ"}, {"yu", "ユ"},
            {"wa", "ワ"}, {"we", "ヱ"}, {"wi", "ヰ"},  {"wo", "ヲ"},
            {"n", "ン"},
            {"ga", "ガ"}, {"ge", "ゲ"}, {"gi", "ギ"},  {"go", "ゴ"}, {"gu", "グ"},
            {"za", "ザ"}, {"ze", "ゼ"}, {"ji", "ジ"},  {"zo", "ゾ"}, {"zu", "ズ"},
            {"da", "ダ"}, {"de", "デ"},/*{"ji", "ヂ"},*/ {"do", "ド"}, /*{"zu", "ヅ"},*/
            {"ba", "バ"}, {"be", "ベ"}, {"bi", "ビ"},  {"bo", "ボ"}, {"bu", "ブ"},
            {"pa", "パ"}, {"pe", "ペ"}, {"pi", "ピ"},  {"po", "ポ"}, {"pu", "プ"},
            {"a", "ア"},  {"e", "エ"},  {"i", "イ"},   {"o", "オ"},  {"u", "ウ"},
        };
    }
}
